{
  "main": {
    "name": "Sai Sankeerth Koduri",
    "description": "A Computer Science graduate from Concordia University with over 2.5 years of experience. I've worked as a Software Developer at Honeywell Technology Solutions and interned at CloudOps Inc. and MTX Group. My expertise includes building diverse applications, from small business websites to dynamic and interactive web applications. I am passionate about crafting robust and user-friendly solutions that deliver exceptional user experiences",
    "image": "Sankeerth.jpg",
    "bio": "Hello, I'm Sankeerth, a dedicated Software Developer on a mission to make a positive impact in the corporate world through technology. Currently based in Canada, I hail from India, where I cultivated my passion for technology and innovation. I am also proud to hold the AWS Certified Solutions Architect-Associate certification, showcasing my commitment to excellence in cloud solutions.",
    "contactmessage": "Get in touch for further details",
    "email": "sankeerth.koduri10@outlook.com",
    "phone": "+1 (514) 943-2369",
    "address": {
      "country": "Canada"
    },
    "resumedownload": "https://drive.google.com/file/d/1PdH9CQrgpb9aFMCYrqCv_O5ArEMaM7CJ/view",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/sankeerth-koduri/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Sankeerth10",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Concordia University, Montreal",
        "degree": "Master's in Applied Computer Science",
        "graduated": "December 2023",
        "description": "Pursuing a Master's degree in Applied Computer Science provided me with a much more comprehensive education in the underlying theories, concepts, and scientific principles behind complex programming. It was during this academic journey that I discovered my true passion for scalable application programming, specifically in the fields of web development."
      },
      {
        "school": "VIT, Vellore",
        "degree": "Bachelor's in Computer Science",
        "graduated": "June 2020",
        "description": "While pursuing Bachelor's in Computer Science in Vellore,I delved into the fascinating world of computer and application system security. During this time, I gained good understanding of all the basics of Computer Science. "
      }
    ],
    "work": [
      {
        "company": "CloudOps Inc.",
        "title": "Cloud Developer Intern",
        "years": "August 2023 - December 2023",
        "description": "Honed my ability to deliver sophisticated and seamless solutions, mastering every layer of application development. My journey has instilled in me a profound understanding of robust backend structures, intuitive frontend design, meticulous testing protocols, and dependable deployment strategies, enabling the execution of each project with precision and creative flair"
      },
      {
        "company": "Honeywell Technology Solutions Pvt Ltd.",
        "title": "Software Engineer",
        "years": "January 2020 - December 2021",
        "description": "Acquired comprehensive experience across all technical phases of the Software Development Life Cycle (SDLC), encompassing Requirement Analysis, Design, Implementation, and Testing. Specializing in both Web-based and Enterprise applications, with a focus on Object-Oriented and Client-Server technologies."
      },
      {
        "company": "MTX IT Consulting Services",
        "title": "Software Engineer intern",
        "years": "May 2018 - July 2018",
        "description": "As an intern, I harvested information from job search websites to generate a comprehensive dataset of ~10K job openings using python’s bs4 library, optimized for visual representation with Tableau. Reduced data retrieval time through optimized querying."
      }
    ],
    "skills": [
      {
        "name": "• Languages: Java8+, Python, C, C++, C#, JavaScript/ES6, NodeJS, React, Vue.js."
      },
      {
        "name": "• Frameworks: NestJS, Play, Spring, ExpressJS."
      },
      {
        "name": "• Databases: MySQL, PostgreSQL, InfluxDB, Elasticsearch, Redis, MongoDB, Dremio."
      },
      {
        "name": "• Visualization tools: Tableau, Grafana, Kibana."
      },
      {
        "name": "• Testing Tools: Spock, Junit, Mockito, Jest, React testing library."
      },
      {
        "name": "• Methodologies & Deployment: Agile, CI/CD, Git, Docker, Kubernetes."
      },
      {
        "name": "• Cloud Technologies: AWS Certified Associate Solution Architect (SAA-C03), Azure, GCP."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Reactive Server-Push web-app",
        "category": "Technologies Used : Java, Play, Akka Streams, Rest API",
        "image": "Java.png",
        "url": "https://github.com/anam-ayesha3097/The-MATRIX"
      },
      {
        "title": "Plagiarism Detection tool",
        "category": "Technologies Used : Java, Bash",
        "image": "Plagiarism.png",
        "url": "https://github.com/Sankeerth10/Plagiarism_Detector"
      },
      {
        "title": "Web-Based Video Capture and Playback Application",
        "category": "Technologies Used : React, Express, NodeJS, Dash.js",
        "image": "Video.png",
        "url": "https://github.com/Sankeerth10/Web-Based-Video-Capture-and-Playback-Application"
      },
      {
        "title": "React Portfolio",
        "category": "Built with React",
        "image": "React.png",
        "url": "https://github.com/Sankeerth10/sankeerth10.github.io"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the pleasure of collaborating with Sankeerth on multiple occasions, and I can confidently say that working with him has been a delightful experience. Sankeerth is a highly motivated individual who consistently demonstrates a positive attitude towards his work.One of Sankeerth's standout qualities is his excellent communication skills. He excels at articulating his ideas and actively listens to others, fostering effective collaboration within the team. Whether it's discussing project requirements or troubleshooting technical issues, Sankeerth ensures that everyone is on the same page, creating a harmonious work environment.",
        "user": "Anirudh Parlapalli - Senior Software Engineer at Honeywell Technology Solutions"
      }
    ]
  }
}