{
  "main": {
    "name": "Sankeerth Koduri",
    "description": "A Full-Stack Developer with over 3 years of experience designing and building scalable, high-performance applications. I am currently working at Aptum Technologies and have previously worked at Honeywell Technology Solutions, with internships at CloudOps Inc. and MTX Group. My expertise lies in developing SaaS platforms, optimizing cloud integrations, and enhancing enterprise software using technologies like Java, Vue.js, Spring Boot, and AWS. Passionate about crafting efficient and secure solutions that drive business success",
    "image": "Sankeerth.jpg",
    "bio": "Hello, I'm Sankeerth, a results-oriented Full-Stack Developer specializing in Java, Spring Boot, Vue.js, and cloud technologies like AWS, GCP, and Kubernetes. Based in Canada, originally from India, I thrive in Agile environments, applying TDD, DevOps best practices, and scalable architecture principles. With a strong background in SaaS and enterprise software, I am committed to building robust, user-centric applications. As an AWS Certified Solutions Architect-Associate, I focus on delivering efficient, cloud-native solutions that drive impact.",
    "contactmessage": "Get in touch for further details",
    "email": "sankeerth.koduri10@outlook.com",
    "phone": "+1 (514) 943-2369",
    "address": {
      "country": "Canada"
    },
    "resumedownload": "https://drive.google.com/file/d/1e2-z2R-adik80DHSePiy8gODfTAH6VC0/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/sankeerth-koduri/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Sankeerth10",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Concordia University, Montreal",
        "degree": "Master's in Applied Computer Science",
        "graduated": "December 2023",
        "description": "Pursuing a Master's degree in Applied Computer Science provided me with a much more comprehensive education in the underlying theories, concepts, and scientific principles behind complex programming. It was during this academic journey that I discovered my true passion for scalable application programming, specifically in the fields of web development."
      },
      {
        "school": "VIT, Vellore",
        "degree": "Bachelor's in Computer Science",
        "graduated": "June 2020",
        "description": "While pursuing Bachelor's in Computer Science in Vellore,I delved into the fascinating world of computer and application system security. During this time, I gained good understanding of all the basics of Computer Science. "
      }
    ],
    "work": [
      {
        "company": "Aptum Technologies",
        "title": "Full-Stack Developer",
        "years": "March 2024 - Present",
        "description": "Developing and enhancing a Java Spring Boot and Vue.js SaaS platform, enabling seamless delivery of edge-to-cloud services. Integrating cloud solutions (AWS, Azure, GCP, VMware, Cloudstack), conducting proof of concepts, and optimizing application performance. Implementing Agile methodologies, TDD, and CI/CD to ensure high-quality, secure, and scalable solutions."
      },
      {
        "company": "CloudOps Inc.",
        "title": "Full-Stack Developer Intern",
        "years": "August 2023 - December 2023",
        "description": "Honed my ability to deliver sophisticated and seamless solutions, mastering every layer of application development. My journey has instilled in me a profound understanding of robust backend structures, intuitive frontend design, meticulous testing protocols, and dependable deployment strategies, enabling the execution of each project with precision and creative flair"
      },
      {
        "company": "Honeywell Technology Solutions Pvt Ltd.",
        "title": "Software Engineer",
        "years": "January 2020 - December 2021",
        "description": "Acquired comprehensive experience across all technical phases of the Software Development Life Cycle (SDLC), encompassing Requirement Analysis, Design, Implementation, and Testing. Specializing in both Web-based and Enterprise applications, with a focus on Object-Oriented and Client-Server technologies."
      },
      {
        "company": "MTX IT Consulting Services",
        "title": "Software Engineer intern",
        "years": "May 2018 - July 2018",
        "description": "As an intern, I harvested information from job search websites to generate a comprehensive dataset of ~10K job openings using python’s bs4 library, optimized for visual representation with Tableau. Reduced data retrieval time through optimized querying."
      }
    ],
    "skills": [
      {
        "name": "• Programming Languages: Java (8+), Python, C, C++, C#, JavaScript (ES6+), TypeScript."
      },
      {
        "name": "• Frontend Technologies: React, Vue.js, HTML, CSS, Tailwind."
      },
      {
        "name": "• Backend Frameworks: Spring Boot, NestJS, Play Framework, Express.js."
      },
      {
        "name": "• Databases: MySQL, PostgreSQL, Elasticsearch, Redis, MongoDB, InfluxDB, Dremio."
      },
      {
        "name": "• Cloud & DevOps: AWS (Certified Solutions Architect – Associate), Azure, GCP, Docker, Kubernetes, Terraform, Jenkins, CI/CD."
      },
      {
        "name": "• Testing & Quality Assurance: JUnit, Mockito, Spock, Jest, React Testing Library, SonarQube."
      },
      {
        "name": "• Monitoring & Visualization: Grafana, Kibana, Tableau."
      },
      {
        "name": "• Development Methodologies: Agile (Scrum, Kanban), TDD, Pair Programming, Git."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Reactive Server-Push web-app",
        "category": "Technologies Used : Java, Play, Akka Streams, Rest API",
        "image": "Java.png",
        "url": "https://github.com/anam-ayesha3097/The-MATRIX"
      },
      {
        "title": "Plagiarism Detection tool",
        "category": "Technologies Used : Java, Bash",
        "image": "Plagiarism.png",
        "url": "https://github.com/Sankeerth10/Plagiarism_Detector"
      },
      {
        "title": "Web-Based Video Capture and Playback Application",
        "category": "Technologies Used : React, Express, NodeJS, Dash.js",
        "image": "Video.png",
        "url": "https://github.com/Sankeerth10/Web-Based-Video-Capture-and-Playback-Application"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the pleasure of collaborating with Sankeerth on multiple occasions, and I can confidently say that working with him has been a delightful experience. Sankeerth is a highly motivated individual who consistently demonstrates a positive attitude towards his work.One of Sankeerth's standout qualities is his excellent communication skills. He excels at articulating his ideas and actively listens to others, fostering effective collaboration within the team. Whether it's discussing project requirements or troubleshooting technical issues, Sankeerth ensures that everyone is on the same page, creating a harmonious work environment.",
        "user": "Anirudh Parlapalli",
        "user_designation": "Senior Software Engineer, Honeywell Technology Solutions"
      }
    ]
  }
}